{
  "project1": {
    "title": "Pet Adoption", 
    "screenshot": "https://raw.githubusercontent.com/jthielman/pet-adoption/master/screenshots/main_view.png", 
    "description": "This is a page that displays a pet adoption agency's available pets in a grid of cards. There are buttons at the top of the page that allow the user to filter the pets according to type, or to show all of them.",
    "technologiesUsed": "HTML, CSS, Vanilla JavaScript, Version Control with Github",
    "available": true,
    "url": "https://pet-adoption-7d51f.firebaseapp.com/",
    "githubUrl": "https://github.com/jthielman/pet-adoption"
  },
  "project2": {
    "title": "Temperature Converter", 
    "screenshot": "https://raw.githubusercontent.com/jthielman/temperature-converter/master/screenshots/main_view.png", 
    "description": "This app allows a user to convert temperatures from degrees Fahrenheit to degrees Celsius or vice versa.  The result of the conversion is displayed in a box at the bottom of the page and is color coded according to whether it is a hot, cold or middling temperature.",
    "technologiesUsed": "HTML, CSS, Vanilla JavaScript, Version Control with Github",
    "available": true,
    "url": "https://temperature-converter-20d51.firebaseapp.com",
    "githubUrl": "https://github.com/jthielman/temperature-converter"
  },
  "project3": {
    "title": "Solar System", 
    "screenshot": "https://raw.githubusercontent.com/jthielman/solar-system/master/screenshots/main_view.png", 
    "description": "This app shows cards with the names of the planets in the solar system. When the user moves the mouse over a card, the name is replaced by a picture of the planet. Clicking on the picture brings up a larger card which includes both picture and name and adds a description of the planet underneath. The user may click a red X in the upper right hand corner to return to the main view.",
    "technologiesUsed": "HTML, CSS, Vanilla JavaScript, Version Control with Github, jQuery, Webpack",
    "available": true,
    "url": "https://solar-system-66c02.firebaseapp.com",
    "githubUrl": "https://github.com/jthielman/solar-system"
  },
  "project4": {
    "title": "Sports Roster", 
    "screenshot": "https://raw.githubusercontent.com/jthielman/sports-roster/master/screenshots/roster_view.png", 
    "description": "This app shows cards with the names and pictures of the players on a user's roster. Users must first log in with Google, but then they may add players (with picture, name and position), see their roster, update player info and even delete players. The assignment called for a sports roster, but since I am much more like a standard nerd, I figured I'd gather some company. A user may choose sportlers instead of fictional IT professionals, if desired, since users can only see their own players, not those of other users.",
    "technologiesUsed": "HTML, CSS, JavaScript, Version Control with Github, jQuery, Webpack, React",
    "available": true,
    "url": "https://sports-roster-4dba6.firebaseapp.com",
    "githubUrl": "https://github.com/jthielman/sports-roster"
  },
  "project5": {
    "title": "ClinkedIn", 
    "screenshot": "https://raw.githubusercontent.com/jthielman/ClinkedIn/master/codescreenshot.png", 
    "description": "An API for an imagined social network for prison inmates.  It includes methods for befriending other inmates and charging for services rendered, among other things.",
    "technologiesUsed": "C#, ASP .NET Core 3.1",
    "available": true,
    "url": "https://github.com/jthielman/ClinkedIn",
    "githubUrl": "https://github.com/jthielman/ClinkedIn"
  },
  "project6": {
    "title": "Anglish Wordbook", 
    "screenshot": "https://raw.githubusercontent.com/jthielman/anglish-wordbook/master/screenshots/anglish-wordbook-home.png", 
    "description": "Anglish is a version of English that avoids borrowed words from French, Latin and Greek in favor of Anglo-Saxon words and word roots, and sometimes reviving old word roots that were pushed out of the language by those borrowings.  Enjoying the thought experiment but weary of trawling through spreadsheet-style word lists to search for Anglish words, I created a React app that makes the searching process more user-friendly, and also allow the adding, editing and deleting of words as they are found, changed or rejected. Site lay out and style are Bootstrap-based, and I employed React Router DOM to enhance the user experience by generating separate pages for single words, the word lists and the create/update form.",
    "technologiesUsed": "HTML, SCSS, JavaScript, Version Control with Github, Webpack, Firebase, React",
    "available": true,
    "url": "https://anglish-wordbook.firebaseapp.com/",
    "githubUrl": "https://github.com/jthielman/anglish-wordbook"
  },
  "project7": {
    "title": "Costume Kit", 
    "screenshot": "https://raw.githubusercontent.com/jthielman/CostumeKit/master/screenshots/main_view.png", 
    "description": "As a tailor and hobbyist costumer, I enjoy sewing and wearing historical and fantasy costumes, but sometimes there is such a variety of garments involved in each outfit that it is hard to keep track of them all, particularly because some garments are used for more than one outfit. So I have made a React app that will help me keep track of all my costume outfits and which garments are included in each. Users can add outfits to their account, manage the garments in each, and see all the garments in the database for inspiration or to add to their own outfit(s). I again used Bootstrap for layout and styling and React Router DOM for routing; I also developed the web API in C#/.NET and the database using T-SQL.",
    "technologiesUsed": "HTML, SCSS, JavaScript, Version Control with Github, Webpack, React, C#, ASP .NET Core 3.1, Dapper, T-SQL",
    "available": true,
    "url": "https://youtu.be/s3E5AVRPt1w",
    "githubUrl": "https://github.com/jthielman/CostumeKit"
  }
}